ketchup-clone/app/controllers/meetings_controller.rb

SELECT * FROM "meetings"
---
  def index
    @meetings = Meeting.all

SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
---
  def show
    @meeting = Meeting.find(params[:id])

INSERT INTO "meetings" ("created_at", "title", "updated_at", "description") VALUES('2010-02-17 15:33:24', 'Paul''s Meeting', '2010-02-17 15:33:24', 'A fine description')
---
  def create
    @meeting = Meeting.new(params[:meeting])

    respond_to do |format|
      if @meeting.save

SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
---
  def update
    @meeting = Meeting.find(params[:id])